Revit 2027 API
AdvancedWood.WoodGrooveRoughness Property
 The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodGrooveRoughness { get; }
Public Shared ReadOnly Property WoodGrooveRoughness As String
	Get
public:
static property String^ WoodGrooveRoughness {
	String^ get ();
}
static member WoodGrooveRoughness : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace